fixtures/charges/charges.json

{
  "object": "list",
  "count": 1,
  "url": "/v1/charges",
  "data": [
    {
      "id": "ch_123456789",
      "object": "charge",
      "created": 123456789,
      "livemode": false,
      "paid": true,
      "amount": 10000,
      "currency": "usd",
      "refunded": false,
      "card": {
        "id": "card_123456789",
        "object": "card",
        "last4": "4242",
        "type": "Visa",
        "exp_month": 1,
        "exp_year": 2020,
        "fingerprint": "abc123456def",
        "customer": null,
        "country": "US",
        "name": "Andrew Thorp",
        "address_line1": null,
        "address_line2": null,
        "address_city": null,
        "address_state": null,
        "address_zip": null,
        "address_country": null,
        "cvc_check": null,
        "address_line1_check": null,
        "address_zip_check": null
      },
      "captured": true,
      "refunds": [],
      "balance_transaction": "txn_123456789",
      "failure_message": null,
      "failure_code": null,
      "amount_refunded": 0,
      "customer": "cus_123456789",
      "invoice": "in_123456789",
      "description": null,
      "dispute": null,
      "metadata": {}
    }
  ]
}
